In [1]:
import pandas as pd

### Read in the public art data and examine the head, tail, shape, info and dtypes

In [2]:
art = pd.read_csv('../data/public_art.csv')
art.head(2)

,Title,Last Name,First Name,Location,Medium,Type,Description,Latitude,Longitude,Mapped Location
0,[Cross Country Runners],Frost,Miley,"4001 Harding Rd., Nashville TN",Bronze,Sculpture,NaN,36.12856,-86.83660,"(36.12856, -86.8366)"
1,[Fourth and Commerce Sculpture],Walker,Lin,"333 Commerce Street, Nashville TN",NaN,Sculpture,NaN,36.16234,-86.77774,"(36.16234, -86.77774)"

In [3]:
art.tail(2)

,Title,Last Name,First Name,Location,Medium,Type,Description,Latitude,Longitude,Mapped Location
130,Women Suffrage Memorial,LeQuire,Alan,"600 Charlotte Avenue, Nashville TN",Bronze sculpture,Sculpture,NaN,36.16527,-86.78382,"(36.16527, -86.78382)"
131,Youth Opportunity Center-STARS Nashville - Pea...,Rudloff,Andee,1704 Charlotte Ave.,House paint on vinyl,Mural,NaN,36.15896,-86.79900,"(36.15896, -86.799)"

In [4]:
art.shape

(132, 10)

In [5]:
art.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 10 columns):
Title              132 non-null object
Last Name          132 non-null object
First Name         122 non-null object
Location           131 non-null object
Medium             128 non-null object
Type               132 non-null object
Description        87 non-null object
Latitude           132 non-null float64
Longitude          132 non-null float64
Mapped Location    132 non-null object
dtypes: float64(2), object(8)
memory usage: 10.4+ KB

In [6]:
art.dtypes

Title               object
Last Name           object
First Name          object
Location            object
Medium              object
Type                object
Description         object
Latitude           float64
Longitude          float64
Mapped Location     object
dtype: object

### Let's explore these pandas methods, attributes, and accessors
 * .shape
 - .head()
 * .tail()
 - .columns
 - .drop()
 - .rename()
 - .query()
 - .loc[]
 - .iloc[]
 - [[]]

In [8]:
art.columns #add .values to force it to print all - if lotttts of columns

array(['Title', 'Last Name', 'First Name', 'Location', 'Medium', 'Type',
       'Description', 'Latitude', 'Longitude', 'Mapped Location'],
      dtype=object)

In [9]:
sculptures = art.query('Type == "Sculpture"')
sculptures.shape

(61, 10)

In [11]:
my_list = ['Sculpture', 'Mural']
sculptures_and_murals = art.query("Type in @my_list")   #this is the actual format
sculptures_and_murals.shape

(99, 10)

In [12]:
#art.loc[art.Type == 'Sculpture']
first_five = art.iloc[0:5, 1:3]   #called "slicing"

In [13]:
first_five

                                  Last Name                 First Name
0                                     Frost                      Miley
1                                    Walker                        Lin
2                                   Kennedy                        Kim
3  Stevenson and Stanley and ROFF (Harroff)  Doug and Ronnica and Lynn
4                                    Ridley                       Greg

In [14]:
artists = art[['Last Name', 'First Name']]
artists.head(2)

  Last Name First Name
0     Frost      Miley
1    Walker        Lin

In [15]:
art = art.drop(columns = ['Mapped Location'])  # brackets needed to pass more than 1

In [16]:
art.columns

Index(['Title', 'Last Name', 'First Name', 'Location', 'Medium', 'Type',
       'Description', 'Latitude', 'Longitude'],
      dtype='object')

In [17]:
art.columns = ['title', 'last', 'first', 'loc', 'med',
              'type', 'desc', 'lat', 'lng']  #using a list to redefine cols - have to include all (position dependent)

In [18]:
art = art.rename(columns = {'Title': 'title', 'Last Name': 'last_name', 'First Name': 'first_name',
           'Location': 'loc', 'Medium': 'medium',  
            'Desccription': 'desc', 'Latiitude': 'lat', 'Longitude': 'lng'})   #using a dictionary - don't have to include each one